import React, { useState } from 'react';
import {BrowserRouter as Router,Switch,Route, Link} from 'react-router-dom';

export default function Cart({products}) {

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// סטייט של מערך מוצרים חדש. המערך הוא פיזור של מערך המוצרים המקורי.
// יצרתי אותו כדי שרק המערך יתרנדר מחדש ולא כל האתר עם כל שינוי שיחול במערך בהמשך
const [cart,setCart]=useState([...products])

// יצרתי משתנה חדש מסוג מערך שהוא מערך המוצרים המקומי של העגלה ללא המוצרים שהם למכירה
//filter- בעזרת פילטר סיננתי את המוצרים שהם למכירה ויצרתי מערך חדש של אלה שלא למכירה. בתוך הפילטר יש תנאי שאם 
// המוצר למכירה= אמת, אז אמת, - בפילטר, מה שאמת נכנס לתוך המערך החדש.
// אם המוצר למכירה=אמת - שקר, כלומר לא נכנס למערך החדש והמסונן 
let cartList=cart.filter(cp=>{
    if (!cp.forSale){
        return true;
    }
    else {return false}
})

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// משתנה חדש מסוג מספר. בהתחלה הוא 0. משתנה זה ייצג את המחיר הכולל של כל המוצרים בעגלה
let total=0

// כדי למצוא את המחיר הכולל של מוצרי העגלה- לולאה שעוברת על כל איברי המערך המפולטר.
// בכל איטרציה מוסיפה את המחיר של המוצר במערך המפולטר לערך הנוכחי של טוטאל
for (let i=0;i<cartList.length;i++){
    total=total+cartList[i].price;
}

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה שרצה כאשר יש אירוע לחיצה על כפתור ה-קנה
// מבצעת לולאה שרצה על כל איברי המערך המקומי שנוצר מהמערך המקורי ומשנה את כולם ל- למכירה=אמת. כדי לנקות את העגלה
// לאחר מכן מציגה הודעה תודה רבה ויש מעבר לעמוד הבית
const buy=()=>{
    for(let i=0;i<cart.length;i++){
        cart[i].forSale=true;
    }
    alert('tnx bitch!')
}
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------


    return (
        <div>
            {cartList.map((cp)=>{
                return(
<div>
    {'name: '+cp.name}
    {' price: '+cp.price}
</div>

                )
            }   
            )}
<h5>total:{total}</h5>

<Link to='/' onClick={buy}><button>Buy</button></Link>
            
        </div>
    )
}
