import React from 'react'
import { Link } from 'react-router-dom'

export default function Menu({titleUser,users, userInLogged,setTitleUser}) {
   
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונציה שרצה כאשה יש לחיצה על לינק לעמוד ההתחברות או ההרשמה. הפונקציה מקבלת איבנט.
// בודקת האם בכותרת ברוכים הבאים זה אורח.
// אם זה לא אורח, כלומר, יש משתמש אשר מחובר למערכת היא חוסמת בעזרת איבנט את המעבר לעמוד 
const handleClickedLiSU=(event)=>{
    if (titleUser!=='guest'){
        event.preventDefault();
    }  
}

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונציה שרצה כאשה יש לחיצה על לינק לעמוד העגלה או לאדיט. הפונקציה מקבלת איבנט.
// בודקת האם בכותרת ברוכים הבאים זה אורח.
// אם זה אורח, כלומר, אין משתמש אשר מחובר למערכת היא חוסמת בעזרת איבנט את המעבר לעמוד 
const onlyLoggedIn=event=>{
    if (titleUser==='guest'){
        event.preventDefault();
    }  
}

//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

// פונקציה אשר תרוץ כאשר יש לחיצה על כפתור ההתנתקות. 
// בודקת האם בברוכים הבאים זה לא אורח, כלומר אם יש משתמש מחובר למערכת
// אם כן אז היא עוברת על מערך המשתמשים והופכת את כולם ללא מחוברים. מכיוון שהחלטתי שרק משתמש אחד יכול להיות מחובר למערכת
// כלומר, אף משתמש לא יהיה מחובר למערכת, למרות שבכל מקרה יש רק משתמש מחובר בכל פעם
// לאחר מכן תשנה את כותרת הברוכים הבאים ל- אורח כמו בהתחלה
const handleLogOut=(user)=>{
    if (titleUser!=='guest'){
        for (let i=0;i<users.length;i++){
            userInLogged({
                userName: users[i].userName,
                password: users[i].password,
                isLoggedIn: false
            })
            setTitleUser('guest')
        }
    }
}
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------------------

    return (
        <div>
            <div>
            <Link to='/'><button>home</button></Link>
            <Link to='/cart' onClick={onlyLoggedIn}><button>cart</button></Link>
            </div>
            <div>
            <Link  to='/signup' onClick={handleClickedLiSU} ><button>sign up</button></Link>
           <Link to='/login'onClick={handleClickedLiSU} > <button>log in</button></Link>
            <Link  to='/edit' onClick={onlyLoggedIn}><button>edit</button></Link>
            <button onClick={handleLogOut} >log out</button>
            </div>
        </div>
    )
}
